In [5]:
import pandas as pd
import numpy as np

In [7]:
#eksik verileri kontrol etme
sozlukVerisi={"ıstanbul":[30,29,np.nan],"ankara": [20,np.nan,25],"izmir":[30,35,42]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [8]:
havaDurumuDataFrame

   ıstanbul  ankara  izmir
0      30.0    20.0     30
1      29.0     NaN     35
2       NaN    25.0     42

In [9]:
havaDurumuDataFrame.dropna()

   ıstanbul  ankara  izmir
0      30.0    20.0     30

In [10]:
havaDurumuDataFrame.index.names=["siralama"]

In [11]:
havaDurumuDataFrame

          ıstanbul  ankara  izmir
siralama
0             30.0    20.0     30
1             29.0     NaN     35
2              NaN    25.0     42

In [12]:
havaDurumuDataFrame.dropna(axis=1)

          izmir
siralama
0            30
1            35
2            42

In [15]:
yeniVerisi={"ıstanbul":[30,29,np.nan],"ankara": [20,np.nan,25],"izmir":[30,35,42],"antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVerisi)

In [16]:
yeniDataFrame

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     30     45.0
1      29.0     NaN     35      NaN
2       NaN    25.0     42      NaN

In [17]:
yeniDataFrame.dropna(axis=1,thresh=2) #nan sayısı 2(thresh) olanları silerek göster (geçici)

   ıstanbul  ankara  izmir
0      30.0    20.0     30
1      29.0     NaN     35
2       NaN    25.0     42

In [18]:
yeniDataFrame

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     30     45.0
1      29.0     NaN     35      NaN
2       NaN    25.0     42      NaN

In [19]:
#nan yazan her yere 30 koyma

In [21]:
yeniDataFrame.fillna(30)

   ıstanbul  ankara  izmir  antalya
0      30.0    20.0     30     45.0
1      29.0    30.0     35     30.0
2      30.0    25.0     42     30.0

## groupby

In [25]:
maasSozlugu = {"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
              "calisan ismi":["ayse","fatma","mehmet","eslem","ahmet","ziya"],
              "maas":[100,120,150,160,200,250]}

In [26]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [27]:
maasDataFrame

   departman calisan ismi  maas
0    yazılım         ayse   100
1    yazılım        fatma   120
2  pazarlama       mehmet   150
3  pazarlama        eslem   160
4      hukuk        ahmet   200
5      hukuk         ziya   250

In [29]:
grupObjesi=maasDataFrame.groupby("departman")

In [30]:
grupObjesi.count()

           calisan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [31]:
grupObjesi.mean() #ortalamayı hesaplıyor. her departmanın ayrı ayrı

            maas
departman
hukuk      225.0
pazarlama  155.0
yazılım    110.0

In [32]:
grupObjesi.min()

          calisan ismi  maas
departman
hukuk            ahmet   200
pazarlama        eslem   150
yazılım           ayse   100

In [33]:
grupObjesi.max()

          calisan ismi  maas
departman
hukuk             ziya   250
pazarlama       mehmet   160
yazılım          fatma   120

In [34]:
grupObjesi.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  225.0  35.355339  200.0  212.5  225.0  237.5  250.0
pazarlama   2.0  155.0   7.071068  150.0  152.5  155.0  157.5  160.0
yazılım     2.0  110.0  14.142136  100.0  105.0  110.0  115.0  120.0

In [35]:
sozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[100,200,250,150]
        }

In [36]:
sozluk2={"isim":["osman","levent","atlas","fatma"],
         "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[150,205,260,350]
        }

In [47]:
sozluk3={"isim":["ayse","mahmut","duygu","nur"],
         "spor":["koşu","yüzme","badminton","tenis"],
        "kalori":[400,500,100,200]
        }

In [40]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [41]:
dataFrame1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     250
3    atıl  basketbol     150

In [42]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [43]:
dataFrame2

     isim       spor  kalori
4    ayse       koşu     400
5  mahmut      yüzme     500
6   duygu  badminton     100
7     nur      tenis     200

In [48]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [49]:
dataFrame3

      isim       spor  kalori
8     ayse       koşu     400
9   mahmut      yüzme     500
10   duygu  badminton     100
11     nur      tenis     200

## concatenation (farklı dataFrameleri alt alta koyma)

In [58]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)#axis 1 olsaydı kolonları birleştirirdi

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yüzme     200
2   zeynep       koşu     250
3     atıl  basketbol     150
4     ayse       koşu     400
5   mahmut      yüzme     500
6    duygu  badminton     100
7      nur      tenis     200
8     ayse       koşu     400
9   mahmut      yüzme     500
10   duygu  badminton     100
11     nur      tenis     200

In [59]:
grupObjesi2=pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0).groupby("kalori")

In [60]:
grupObjesi2

In [61]:
grupObjesi2.describe()

        isim                      spor
       count unique     top freq count unique        top freq
kalori
100        3      2   duygu    2     3      2  badminton    2
150        1      1    atıl    1     1      1  basketbol    1
200        3      2     nur    2     3      2      tenis    2
250        1      1  zeynep    1     1      1       koşu    1
400        2      1    ayse    2     2      1       koşu    2
500        2      1  mahmut    2     2      1      yüzme    2

## merge -> kaynaştırmak

In [65]:
mergeSozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor":["koşu","yüzme","koşu","basketbol"]
        }

mergeSozluk2={"isim":["ahmet","mehmet","zeynep","atıl"],
        "kalori":[100,200,250,150]
        }

In [66]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [67]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [68]:
mergeDataFrame1

     isim       spor
0   ahmet       koşu
1  mehmet      yüzme
2  zeynep       koşu
3    atıl  basketbol

In [69]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     250
3    atıl     150

In [70]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="isim") # ortak kolona göre eşleme birleştirme

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     250
3    atıl  basketbol     150

In [71]:
maasSozluk={"isim":["ayse","zeynep","mehmet","ahmet"],
           "departman":["yazılım","satış","pazarlama","yazılım"],
            "maas":[200,300,400,500]
           }

In [72]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [73]:
maasDataFrame

     isim  departman  maas
0    ayse    yazılım   200
1  zeynep      satış   300
2  mehmet  pazarlama   400
3   ahmet    yazılım   500

In [74]:
maasDataFrame["departman"]

0      yazılım
1        satış
2    pazarlama
3      yazılım
Name: departman, dtype: object

In [75]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [76]:
maasDataFrame["departman"].nunique() #kaç departman türü var

3

In [78]:
maasDataFrame["departman"].value_counts()

yazılım      2
satış        1
pazarlama    1
Name: departman, dtype: int64

In [79]:
def bruttenNete(maas):
    return maas * 0.66

In [81]:
maasDataFrame["maas"].apply(bruttenNete) #fonksiyonları apply ile kolayca uygulayabiliyoruz

0    132.0
1    198.0
2    264.0
3    330.0
Name: maas, dtype: float64

In [82]:
maasDataFrame.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False